In [1]:
import pandas as pd
import json

In [2]:
df = pd.read_csv("./data/titanic.csv")

In [3]:
def get_column_info(df):
    shape = get_shape(df)
    describe = get_describe(df)
    null_count = get_null_count(df)
    column_type = get_column_type(df)
    value_count = get_value_counts(df)

    tmp_json = describe

    info_dict = {"nullCount": null_count, "dtype": column_type, "valueCount": value_count}

    for key, value in info_dict.items():
        for col in value.keys():
            tmp_json[col][key] = value[col]

    return {"columnInfo": tmp_json, "shape": shape}

In [4]:
get_column_info(df)

NameError: name 'get_shape' is not defined

In [21]:
def get_chart_value_counts(df, orient="index"):

    # tmp = df.value_counts().to_json(orient=orient)
    # value_counts = json.loads(tmp)

    value_counts = {}

    for col in df.columns:
        tmp = df[col].value_counts()
        tmp.sort_index(inplace=True)

        tmp = tmp.to_json(orient=orient)
        value_counts[col] = json.loads(tmp)

    return value_counts

In [22]:
get_chart_value_counts(df[["Embarked"]])

{'Embarked': {'C': 168, 'Q': 77, 'S': 644}}

In [41]:
df_age = df[["Age"]]

In [55]:
df_age["value"] = 1

In [25]:
def to_json(df, orient):
    result = df.to_json(orient=orient)
    return json.loads(result)

In [26]:
df_age

      Age  value
0    22.0      1
1    38.0      1
2    26.0      1
3    35.0      1
4    35.0      1
..    ...    ...
886  27.0      1
887  19.0      1
888   NaN      1
889  26.0      1
890  32.0      1

[891 rows x 2 columns]

In [56]:
df_age = df_age[:50].dropna()

In [57]:
orient = "split"

tmp = to_json(df_age, orient)

In [58]:
"".join([22.0])

TypeError: sequence item 0: expected str instance, float found

In [67]:
result = {}
result["columnData"] = None
result["valueCount"] = {}

for key,value in tmp.items():
    if key == "columns":
        result["column"] = value
    elif key == "data":
        for v in value:
            #print(v[0], v[1])
            result["valueCount"][v[0]] = v[1]

In [68]:
result

{'columnData': None,
 'valueCount': {22.0: 1,
  38.0: 1,
  26.0: 1,
  35.0: 1,
  54.0: 1,
  2.0: 1,
  27.0: 1,
  14.0: 1,
  4.0: 1,
  58.0: 1,
  20.0: 1,
  39.0: 1,
  55.0: 1,
  31.0: 1,
  34.0: 1,
  15.0: 1,
  28.0: 1,
  8.0: 1,
  19.0: 1,
  40.0: 1,
  66.0: 1,
  42.0: 1,
  21.0: 1,
  18.0: 1,
  3.0: 1},
 'column': ['Age', 'value']}

In [61]:
for key in tmp['data']:
    print(key[0], key[1])

22.0 1
38.0 1
26.0 1
35.0 1
35.0 1
54.0 1
2.0 1
27.0 1
14.0 1
4.0 1
58.0 1
20.0 1
39.0 1
14.0 1
55.0 1
2.0 1
31.0 1
35.0 1
34.0 1
15.0 1
28.0 1
8.0 1
38.0 1
19.0 1
40.0 1
66.0 1
28.0 1
42.0 1
21.0 1
18.0 1
14.0 1
40.0 1
27.0 1
3.0 1
19.0 1
18.0 1

In [11]:
orient = "split"

tmp = to_json(df, orient)
result = {}
result["valueCount"] = None

NameError: name 'to_json' is not defined

In [ ]:
ㅇㄹ

In [69]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [70]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [77]:
def sampling(df, **kwargs):
    return df.sample(**kwargs)

In [86]:
df_sample

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
709,710,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C
439,440,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
720,721,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
106,107,1,3,"Salkjelsvik, Miss. Anna Kristine",female,21.0,0,0,343120,7.6500,NaN,S
270,271,0,1,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S
860,861,0,3,"Hansen, Mr. Claus Peter",male,41.0,2,0,350026,14.1083,NaN,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0000,B96 B98,S
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S

In [88]:
df = pd.read_csv('./data/titanic.csv', usecols=["Age"])

In [93]:
path = './data/titanic.csv'
x = "Age"
num_row = 891
fraction = None
random_state=42

In [104]:
def get_histogram_data(path, x, num_row, fraction, random_state):

    df = pd.read_csv(path, usecols=[x])

    if num_row:
        if num_row > df.shape[0]:
            num_row = df.shape[0]
        df = sampling(df, n=num_row, random_state=random_state)
    elif fraction:
        df = sampling(df, frac=fraction, random_state=random_state)
    print("전체 데이터 갯수 : ", df.shape)
    print("null값 갯수 : ",df.isnull().sum())

    df = df.dropna()
    print("null 삭제 후 전체 데이터 갯수 : ", df.shape)
    df["value"] = 1

    orient = "split"

    tmp = to_json(df, orient)
    result = {}
    result["columnData"] = None
    result["valueCount"] = {}
    i = 0
    for key,value in tmp.items():
        if key == "columns":
            result["column"] = value
        elif key == "data":
            #result["columnData"] = value
            print(len(value))
            for v in value:
                i = i + 1
                result["valueCount"][v[0]] = v[1]
                
    print("for문 횟수 : ", i)

    return result

In [105]:
tmp= get_histogram_data(path, x, num_row, fraction, random_state)
len(tmp["valueCount"])

전체 데이터 갯수 :  (891, 1)
null값 갯수 :  Age    177
dtype: int64
null 삭제 후 전체 데이터 갯수 :  (714, 1)
714
for문 횟수 :  714

88

In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("./data/titanic.csv", usecols=["Age", "Fare", "Sex"])

In [8]:
df

        Sex   Age     Fare
0      male  22.0   7.2500
1    female  38.0  71.2833
2    female  26.0   7.9250
3    female  35.0  53.1000
4      male  35.0   8.0500
..      ...   ...      ...
886    male  27.0  13.0000
887  female  19.0  30.0000
888  female   NaN  23.4500
889    male  26.0  30.0000
890    male  32.0   7.7500

[891 rows x 3 columns]

In [9]:
df.insert(0, "id", "")

In [10]:
df

    id     Sex   Age     Fare
0         male  22.0   7.2500
1       female  38.0  71.2833
2       female  26.0   7.9250
3       female  35.0  53.1000
4         male  35.0   8.0500
..  ..     ...   ...      ...
886       male  27.0  13.0000
887     female  19.0  30.0000
888     female   NaN  23.4500
889       male  26.0  30.0000
890       male  32.0   7.7500

[891 rows x 4 columns]